#!/usr/bin/env bash
# pkglist.txt — install all packages from this list:
#   sudo pacman -S --needed - < pkglist.txt
#   cat pkglist.txt | xargs sudo pacman -S --needed --noconfirm
#
# Generated from install.sh — keeps a flat record of every package.

# BASE + DEV
base-devel
git
vim
nano
gcc
gdb
make
cmake
ninja
pkgconf
autoconf
automake
libtool
python
python-pip
python-virtualenv
go
rust
nodejs
npm
yarn
docker
docker-compose
openssh
rsync
wget
curl
jq
yq
unzip
p7zip
zip
unrar
shellcheck
shfmt
stylua
black
ruff
pyright
isort
gopls
rust-analyzer
marksman
pandoc

# SHELL + TERMINAL
tmux
tmuxp
zsh
zsh-completions
zsh-autosuggestions
zsh-syntax-highlighting
ripgrep
fd
fzf
bat
eza
btop
htop
neofetch
starship
zoxide
mcfly
neovim
lazygit
lazydocker
broot
delta
dysk
choose-rustic
sd
xsv
tokei
hyperfine
pueue
just
watchexec
tldr
navi
cheat
ipython
bpython
glow
mdcat
lynx
w3m

# WAYLAND RICE
hyprland
hyprlock
hypridle
hyprland-qtutils
hyprshot
waybar
mako
swaync
wlogout
rofi-wayland
swww
grim
slurp
wl-clipboard
cliphist
kitty
alacritty
foot
qt5-wayland
qt6-wayland
polkit-gnome
xdg-desktop-portal-hyprland
xdg-utils
pipewire
pipewire-pulse
wireplumber
pavucontrol
brightnessctl
playerctl
thunar
thunar-archive-plugin
thunar-media-tags-plugin
network-manager-applet
blueman
sddm

# FONTS
ttf-jetbrains-mono-nerd
ttf-firacode-nerd
ttf-hack-nerd
noto-fonts
noto-fonts-emoji
noto-fonts-cjk
ttf-font-awesome
ttf-meslo-nerd
awesome-terminal-fonts

# MULTIMEDIA
ffmpeg
imagemagick
sox
cava
cmus
mpv
vlc
obs-studio
yt-dlp
streamlink
espeak-ng
festival
festival-english
piper-tts
piper-bin
tesseract
tesseract-data-eng
whisper-cpp

# CYBERSECURITY CORE
nmap
masscan
wireshark-qt
tcpdump
netcat-openbsd
socat
aircrack-ng
kismet
wifite
bettercap
ettercap
john
hashcat
hydra
seclists
wordlists
gobuster
ffuf
feroxbuster
dirb
sqlmap
nikto
wfuzz
zaproxy
metasploit
impacket
responder
crackmapexec
bloodhound
ghidra
radare2
rizin
cutter
volatility3
binwalk
foremost
sleuthkit
strace
ltrace
lsof
tor
torsocks
proxychains-ng
macchanger
firefox
chromium
exploitdb
dnsutils
whois
bind

# AUR / ADVANCED (via paru)
# burpsuite, pro, pwndbg, evil-winrm, routersploit, theharvester,
# recon-ng, maltego, subfinder, httpx, nuclei, wpscan,
# mimipenguin, linpeas, winpeas, setoolkit, beef-xss, hashcat-utils,
# steghide, stegseek

# PRODUCTIVITY
obsidian
task
timewarrior
calcurse
khal
vdirsyncer
keepassxc
pass
gpg
gnupg
veracrypt
wireguard-tools
signal-desktop
rclone
borg
timeshift
syncthing